getting the same on this version
```
Terraform v0.14.11
+ provider registry.terraform.io/hashicorp/azurerm v2.72.0
+ provider registry.terraform.io/hashicorp/external v2.1.
```

Adding the new frontend IP configuration wants to re-create the load balancer itself - no matter the availability_zone setting

```
  # module.lb.azurerm_lb.lb must be replaced
-/+ resource "azurerm_lb" "lb" {
      ~ id                   = "/subscriptions/XXXXXXX" -> (known after apply)
        name                 = "lb-internal-xxxxx-1"
      ~ private_ip_address   = xxxxxxx" -> (known after apply)
      ~ private_ip_addresses = [
          - "xxxxx",
        ] -> (known after apply)
        tags                 = {
            "environment" = "prod"
        }
        # (3 unchanged attributes hidden)

      ~ frontend_ip_configuration {
          ~ id                            = "/subscriptions/XXXXXXX-1" -> (known after apply)
          ~ inbound_nat_rules             = [] -> (known after apply)
          ~ load_balancer_rules           = [
              - "/subscriptions/XXXXXXX-1",
              - "/subscriptions/XXXXXXX-2",
              - "/subscriptions/XXXXXXX-3",
            ] -> (known after apply)
          ~ outbound_rules                = [] -> (known after apply)
          ~ private_ip_address            = "xxxxx" -> (known after apply)
          ~ private_ip_address_allocation = "Dynamic" -> "dynamic"
          + public_ip_address_id          = (known after apply)
          + public_ip_prefix_id           = (known after apply)
          ~ zones                         = [] -> (known after apply)
            # (3 unchanged attributes hidden)
        }
      + frontend_ip_configuration {
          + availability_zone             = "No-Zone" # forces replacement
          + id                            = (known after apply)
          + inbound_nat_rules             = (known after apply)
          + load_balancer_rules           = (known after apply)
          + name                          = "internal-xxxxx"
          + outbound_rules                = (known after apply)
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "dynamic"
          + private_ip_address_version    = "IPv4"
          + public_ip_address_id          = (known after apply)
          + public_ip_prefix_id           = (known after apply)
          + subnet_id                     = "/subscriptions/XXXXXXX"
          + zones                         = (known after apply) # forces replacement
        }
    }

```

this seems to be introduced in 2.64.0 as @kjanss said with https://github.com/hashicorp/terraform-provider-azurerm/pull/12208
trying with the 2.63.0 provider does not help since `availability_zone` cannot be used/set with that and previous versions

This is preventing us from any new changes on the LB as we cannot update our balancers...